[
    {
        "title": " Spiced lentil & spinach pies",
        "ingredients": [
            "1 tbsp sunflower oil",
            "1 large onion - finely chopped",
            "5 garlic cloves - grated",
            "thumb-sized piece of ginger - peeled and finely grated",
            "1 tsp cumin",
            "1½ tsp turmeric",
            "½ cinnamon stick",
            "pinch of chilli flakes",
            "250g red split lentils",
            "600ml vegetable stock",
            "30g butter",
            "300g spinach",
            "1 lemon",
            "zested and juiced",
            "2 tbsp chopped coriander",
            "6 tbsp chutney",
            "1 quantity all-butter pie pastry",
            "3 egg yolks",
            "½ tsp turmeric",
            "1 tsp cumin seeds",
            "1 tsp sea salt flakes"
        ],
        "method": "Step 1 Heat the oil in a wide-based pan. Add the onion and cook over a low heat for 10 mins, stirring, until softened. Mix in the garlic, ginger and spices and cook for 1 min more. Tip in the lentils, pour over the vegetable stock, season and bring to the boil. Reduce the heat, then cover and cook for 20 mins until the lentils are tender. Step 2 Meanwhile, heat half the butter in a large pan, add the spinach and cook until wilted. Season, then drain. Stir the spinach through the lentils with the lemon zest and juice and coriander, then leave to cool. Step 3 Mix together all the ingredients for the egg wash. Assemble the pies as directed in the pastry recipe, adding a spoonful of chutney to the middle of each. Glaze with the spiced egg wash before baking.",
        "rating": 4.5,
        "img": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/spiced-lentil-spinach-pies-a1ae301.jpg?quality=90&webp=true&resize=440,400",
        "vegetarian": true,
        "id": 1
    },
    {
        "title": "Stuffed pumpkin",
        "ingredients": [
            "1 medium-sized pumpkin or round squash about 1kg",
            "4 tbsp olive oil",
            "100g wild rice",
            "1 large fennel bulb",
            "1 Bramley apple",
            "1 lemon zested and juiced",
            "1 tbsp fennel seeds",
            "½ tsp chilli flakes",
            "2 garlic cloves crushed",
            "30g pecans toasted and roughly chopped",
            "1 large pack parsley roughly chopped",
            "3 tbsp tahini",
            "pomegranate seeds to serve"
        ],
        "method": "Step 1 Heat oven to 200C/180C fan/gas 6. Cut the top off the pumpkin or squash and use a metal spoon to scoop out the seeds. Get rid of any pithy bits but keep the seeds for another time (see our pumpkin seed recipe ideas). Put the pumpkin on a baking tray, rub with 2 tbsp of the oil inside and out, and season well. Roast in the centre of the oven for 45 mins or until tender, with the lid on the side. Step 2 Meanwhile, rinse the wild rice well and cook following pack instructions, then spread out on a baking tray to cool. Thinly slice the fennel bulb and apple, then squeeze over ½ the lemon juice to stop them discolouring. Step 3 Heat the remaining 2 tbsp oil in a frying pan. Fry the fennel seeds and chilli flakes, then, once the seeds begin to pop, stir in ½ the garlic and the fennel. Cook for 5 mins until softened, then mix through the apple, pecans and lemon zest. Remove from the heat. Add the mixture to the the cooked rice, then stir in the chopped parsley and taste for seasoning. Step 4 Pack the mixture into the cooked pumpkin and return to the oven for 10-15 mins until everything is piping hot. Meanwhile, whisk the remaining lemon juice with the tahini, the rest of the garlic and enough water to make a dressing. Serve the pumpkin in the middle of the table, topped with pomegranate seeds and the dressing.",
        "rating": 4.0,
        "img": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/pumpkin-57f52fa.jpg?quality=90&webp=true&resize=440,400",
        "vegetarian": false,
        "id": 2
    },
    {
        "title": "Golden-glazed carrot, mushroom & hazelnut tart",
        "ingredients": [
            "3 carrots peeled and cut in half lengthways, or about 10 baby carrots left whole",
            "2 tsp olive oil",
            "1 tbsp maple syrup",
            "15 x 12cm rectangle of all-butter puff pastry from a 320g roll",
            "1 banana shallot or 2 normal shallots, very finely diced",
            "small knob of butter",
            "140g chestnut mushroom very finely chopped",
            "1 tbsp chopped roasted hazelnut plus a little extra to garnish",
            "3 tbsp low-fat cream cheese",
            "a few tarragon leaves, chopped, plus a few leaves to garnish"
        ],
        "method": "Step 1 Heat oven to 200C/180C fan/gas 6. Pop the carrots in a pan of boiling water and cook for 4-5 mins until tender. Spread the carrots out in one layer on a baking tray. Carefully toss with olive oil, seasoning and half the maple syrup. Bake for 20 mins, turning once. Step 2 Next, place the pastry rectangle on a baking parchment-lined baking sheet. Score a 1cm border. Prick the centre area with a fork and put in the oven for 12 mins with the carrots. Step 3 Fry the shallot in butter until totally soft, then stir through the mushrooms. Fry for several mins until mushrooms are tender and the mixture is dry. Spread out on a plate to cool. Whizz a third of the mushroom mixture with the nuts, cream cheese, tarragon and seasoning, so you have a coarse texture. Tip into a bowl and stir through the remaining mushroom mix. Step 4 Remove the pastry base from the oven and gently press down the centre area with the back of a spoon. Spread the mushroom mix inside and lay the glazed carrots on top. You may need to tuck the ends round to fit the carrots in. Drizzle over the remaining maple syrup and bake for a further 12-15 mins until the pastry is golden. Sprinkle with a few tarragon leaves and some more chopped nuts to serve.",
        "rating": 5.0,
        "img": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/veggie-182fdd2.jpg?quality=90&webp=true&resize=440,400",
        "vegetarian": true,
        "id": 3
    },
    {
        "title": "Roasted spiced cauliflower",
        "ingredients": [
            "1 tsp ras el hanout",
            "¼ tsp cinnamon",
            "½ tsp smoked paprika",
            "1 garlic clove crushed",
            "1 tsp olive oil",
            "170g pot Greek yogurt",
            "1 small cauliflower",
            "2 tbsp tahini",
            "juice 2 lemons",
            "400g can chickpeas drained",
            "2 wholemeal pitta breads (or gluten-free alternative)",
            "110g pack pomegranate seeds (or seeds from 1 small pomegranate)",
            "2 tbsp sunflower seeds toasted",
            "small handful flat-leaf parsley leaves only, chopped",
            "small handful mint leaves only, chopped"
        ],
        "method": "Step 1 Heat oven to 180C/160C fan/gas 4. In a small bowl, mix together the ras el hanout, cinnamon, paprika, garlic, oil and yogurt. Take the cauliflower and remove the outer leaves and the base of the stalk so that it sits flat in a large roasting tin. Rub the spiced yogurt mixture all over it then pour 100ml water into the roasting tin around the base of the cauliflower. Cover with foil and bake in the oven for 45 mins. Step 2 Meanwhile, put the tahini in a bowl and slowly add the lemon juice, stirring constantly, to make a smooth sauce – it should be the consistency of single cream. Chill until needed. Step 3 When the cauliflower has roasted, remove the foil and return to the oven for a further 10-15 mins. Put the chickpeas in a saucepan with 50ml water and cook over a medium heat until piping hot. Season, then crush with a potato masher – you want some to be smooth and others to be just a little broken. Stir in 1 tsp of the tahini sauce. Step 4 Take the cauliflower out of the oven and put the pitta bread in to warm for 2-3 mins while you cut the cauliflower into 8 wedges. Step 5 To serve, place a warmed pitta bread on each plate, top with the crushed chickpeas followed by the cauliflower wedges. Drizzle with the remaining tahini sauce and sprinkle over the pomegranate seeds, sunflower seeds and herbs. Serve warm or cold. Recipe from Good Food magazine, February 2016 More from around the web",
        "rating": 4.8,
        "img": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/roasted-spiced-cauliflower-ad129f9.jpg?quality=90&webp=true&resize=440,400",
        "vegetarian": true,
        "id": 4
    },
    {
        "title": "Shallot tatin",
        "ingredients": [
            "450g shallot",
            "3 tbsp demerara sugar",
            "50g butter",
            "1 tsp fresh thyme leaves",
            "1 tbsp balsamic vinegar or a few grindings of cracked black pepper",
            "plain flour for dusting",
            "500g pack puff pastry"
        ],
        "method": "Step 1 Heat the oven to 200C/180C fan/gas 6. Pour boiling water over the shallots and leave them until the water cools. (This makes it easier to slip the skins off.) Peel and halve the shallots, then set aside. Put the sugar in a 23cm ovenproof frying pan and heat until it dissolves and you have a sticky caramel. Add the butter, thyme and a splash of balsamic vinegar or cracked black pepper. Take care as it will spit. Step 2 Remove the pan from the heat and put all the shallots into the pan, cut-side down. On a lightly floured surface, roll out the pastry and cut out a round 2cm larger than the pan. Drape the pastry over the shallots and tuck in the edges, so that it hugs the shallots. Place the pan in the oven and cook for 25-30 mins until the pastry is puffed up and golden. Leave to rest for 1 min, then invert the tart onto a plate. Serve with a punchy salad of rocket and goats cheese.",
        "rating": 4.4,
        "img": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/tart-tatin-c923e5c.jpg?quality=90&webp=true&resize=440,400",
        "vegetarian": false,
        "id": 5
    },
    {
        "title": "spinach",
        "ingredients": [
            "spinach"
        ],
        "method": "cook",
        "rating": 2.5,
        "img": "www.spinach.com",
        "vegetarian": true,
        "id": 6
    },
    {
        "title": "alma",
        "ingredients": [
            "alma"
        ],
        "method": "alma cook",
        "rating": 1.6,
        "img": "www.alma.com",
        "vegetarian": true,
        "id": 7
    },
    {
        "title": "forte",
        "ingredients": [
            "forte"
        ],
        "method": "korte bake",
        "rating": 5.0,
        "img": "www.korte.com",
        "vegetarian": false,
        "id": 8
    },
    {
        "title": "Dios bejgli",
        "ingredients": [
            "string"
        ],
        "method": "string",
        "rating": 0.0,
        "img": "string",
        "vegetarian": true,
        "id": 9
    }
]